app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
  def create
    @school_class = School_class.new(school_class_params(:title, :room_number))
>>>>>>> 3cd70c33415891b98556c9a7235cb3e75c08435b
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
<<<<<<< HEAD
    @school_class = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class = School_class.find(params[:id])
>>>>>>> 3cd70c33415891b98556c9a7235cb3e75c08435b
    @school_class.update(school_class_params(:title, :room_number))